package com.skyline.common.constant;


public enum C2cStatusCode  {
	E00201("E00201","此币种未开放交易"),
	E00202("E00202","此币种暂时不能交易"),
	E00203("E00203","小于最小买入量"),
	E00204("E00204","大于最大买入量"),
	E00205("E00205","小于最小卖出量"),
	E00206("E00206","大于最大卖出量"),
	E00207("E00207","撤消广告交易失败"),
	E00208("E00208","查询广告信息失败"),
	E00209("E00209","发布广告信息失败"),
	E00210("E00210","不是商户"),
	E00211("E00211","订单信息不存在"),
	E00212("E00212","交易类型不存在"),
	E00213("E00213","信息异常"),
	E00214("E00214","撤销剩余成交量异常"),
	E00215("E00215","更改为撤销异常"),
	E00216("E00216","该交易类型已存在！"),
	E00217("E00217","该订单可售币数量不足"),
	E00218("E00218","交易额不能低于最低交易额"),
	E00219("E00219","交易额不能高于最高交易额"),
	E00220("E00220","当前状态不可申诉"),
	E00221("E00221","申诉人员不对应"),
	E00222("E00222","审核状态不对"),
	E00223("E00223","更改订单状态异常"),
	E00224("E00224","已有未完成订单，不能交易"),
	E00225("E00225","不能与自己交易"),
	E00226("E00226","广告不存在"),
	E00227("E00227","用户权限不足"),
	E00228("E00228","总交易数不能改为低于当前广告正在交易的交易总数"),
	E00229("E00229","更改广告信息失败"),
	E00230("E00230","订单状态不对"),
	E00231("E00231","文件不存在"),
	E00232("E00232","审诉状态不对"),
	E00233("E00233","此审诉订单已不能撤消"),
	E00234("E00234","已经提交过审诉不能重复提交"),
	E00235("E00235","请绑定相应的支付方式"),
	E00236("E00236","可用资产不足"),
	E00237("E00237","冻结资产失败"),
	E00238("E00238","更新资产失败"),
	E00239("E00239","当前有未处理的订单，不能撤消"),
	E00240("E00240","该支付方式已添加，不能重复添加"),
	E00241("E00241","该支付方式添加失败");
	private C2cStatusCode(String code,String msg) {
		this.code=code;
		this.msg=msg;
	}
	private String code;	//状态码
	private String msg;		//状态说明
	
	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}
	public String getMsg() {
		return msg;
	}
	public void setMsg(String msg) {
		this.msg = msg;
	}
}
