package com.skyline.common.constant;


/**
 * 币币交易状态码
 * @author Yjian
 * @time 2018-07-13
 */
public enum TradeStatusCode {
	/*后台参数验证*/
	E00301("E00301","交易已关盘"),
	E00302("E00302","余额不足"),
	E00303("E00303","超过最大买入数"),
	E00304("E00304","未达到最小买入数"),
	E00305("E00305","超过最大卖出数"),
	E00306("E00306","未达到最小卖出数"),
	E00307("E00307","信息操作失败"),
	E00308("E00308","状态验证失败"),
	E00309("E00309","行情id或用户id不存在或其他信息不全,委托失败"),
	E00310("E00310","余额获取失败"),
	E00311("E00311","委托信息保存失败"),
	E00312("E00312","委托交易信息验证失败"),
	E00313("E00313","获取委托交易信息失败"),
	E00314("E00314","解冻余额失败"),
	E00315("E00315","委托状态验证失败"),
	E00316("E0316","委托撤销失败"),
	E30017("E00317","撤销委托时，余额保存失败"),
	E00318("E00318","用户余额变更记录"),
	E00319("E00319","从数据库获取币币交易类型"),
	E00320("E00320","从数据库获取交易市场的详情信息失败"),
	E00321("E00321","币币交易信息从数据库获取失败"),
	E00322("E00322","查询币币交易委托信息"),
	E00323("E00323","行情查询失败，或该行情已经不存在！"),
	E00326("E00326","k线类型参数无效"),
	E00327("E00327","行情id参数无效"),
	E00328("E00328","买方数据获取失败！"),
	E00329("E00328","卖方数据获取失败！"),
	E00330("E00330","可交易币种信息获取失败"),
	E00331("E00331","委托成功，稍后手动刷新委托信息！"),
	E00332("E00332","最新成交记录查询失败"),
	E00336("E00336","自选取消失败"),
	E00337("E00337","行情收藏失败"),
	E00338("E00338","该选项已经存在，不可重复添加"),
	/*前台参数验证*/
	E00401("E00401","请求参数无效!"),
	E00325("E00325","你先登陆，再查看此项!"),
	/*提示*/
	SUCCESS("SUCCESS","成功"),
	FAILED("FAILED","失败"),
	E00333("E00333","查询用户的委托交易信息失败"),
	E00334("E00334","智能撮合初始化,获取行情信息失败"),
	E00335("E00335","查询最新买卖委托买数据失败");
	private TradeStatusCode(String code,String msg) {
		this.code=code;
		this.msg=msg;
	}
	private String code;	//状态码
	private String msg;		//状态说明
	
	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}
	public String getMsg() {
		return msg;
	}
	public void setMsg(String msg) {
		this.msg = msg;
	}

}
